// Задача №1 (Семинар) найдите квадрат числа

Console.Write("Enter your number:");
int number = int.Parse(Console.ReadLine());
int result = number*number;
Console.Write("Square of your number: ");
Console.WriteLine(result);

// Задача №2 (Семинар) 